---
layout: article
title: notr内网穿透发展历程
---
      <div class="mume markdown-preview pad">
          <h2>{{ page.title }}</h2>
      <p>&#x6211;&#x4EEC;&#x5F00;&#x53D1;&#x4E86;&#x4E00;&#x4E2A;&#x5185;&#x7F51;&#x7A7F;&#x900F;&#x8F6F;&#x4EF6;<a href="https://www.notr.tech">Notr</a>&#xFF0C;&#x6574;&#x4E2A;&#x8F6F;&#x4EF6;&#x7ECF;&#x5386;&#x4E86;&#x5C06;&#x8FD1;&#x4E00;&#x5E74;&#x7684;&#x53D8;&#x66F4;&#xFF0C;&#x6700;&#x8FD1;&#x8F6F;&#x4EF6;&#x57FA;&#x672C;&#x7A33;&#x5B9A;&#xFF0C;&#x7528;&#x6237;&#x57FA;&#x672C;&#x4E5F;&#x6CA1;&#x5728;&#x63D0;bug&#x4E86;&#xFF0C;&#x5F88;&#x662F;&#x6B23;&#x6170;&#x3002;&#x4E5F;&#x662F;&#x7531;&#x4E8E;&#x6700;&#x8FD1;&#x5904;&#x4E8E;&#x5F85;&#x4E1A;&#x72B6;&#x6001;&#xFF0C;&#x6709;&#x7684;&#x662F;&#x65F6;&#x95F4;&#xFF0C;&#x6240;&#x4EE5;&#x5C06;&#x6574;&#x4E2A;&#x8F6F;&#x4EF6;&#x7684;&#x7248;&#x672C;&#x53D8;&#x66F4;&#x505A;&#x4E00;&#x6B21;&#x8BB0;&#x5F55;&#x3002;</p>
<h2 class="mume-header" id="%E9%A1%B9%E7%9B%AE%E8%B5%B7%E6%BA%90">&#x9879;&#x76EE;&#x8D77;&#x6E90;</h2>

<p>Notr&#x9879;&#x76EE;&#x7684;&#x8D77;&#x6E90;&#x662F;&#x6211;&#x81EA;&#x5DF1;&#x4E1A;&#x4F59;&#x65F6;&#x95F4;&#x5199;&#x7684;&#x4E00;&#x4E2A;&#x5F00;&#x6E90;&#x7684;&#x9879;&#x76EE;<a href="https://github.com/ICKelin/gtun">gtun</a>&#xFF0C;gtun&#x672C;&#x8D28;&#x662F;&#x4E00;&#x4E2A;&#x5FAE;PN&#xFF0C;&#x5199;gtun&#x6700;&#x4E3B;&#x8981;&#x7684;&#x76EE;&#x7684;&#x662F;&#x89E3;&#x51B3;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;</p>
<ol>
<li>&#x65B9;&#x4FBF;&#x5728;&#x5BB6;&#x91CC;&#x80FD;&#x591F;&#x8BBF;&#x95EE;&#x516C;&#x53F8;</li>
<li>&#x5BB6;&#x91CC;&#x7684;&#x4E0A;&#x5916;&#x7F51;&#x7528;</li>
</ol>
<p>&#x76EE;&#x524D;&#x5BB6;&#x91CC;&#x4E00;&#x76F4;&#x90FD;&#x6709;&#x5728;&#x7528;gtun&#x6765;&#x4E0A;&#x5916;&#x7F51;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x7ED3;&#x5408;&#x6811;&#x8393;&#x6D3E;&#x505A;&#x7F51;&#x5173;&#xFF0C;&#x6240;&#x4EE5;&#x57FA;&#x672C;&#x4E0A;&#x5BB6;&#x91CC;&#x6240;&#x6709;&#x8BBE;&#x5907;&#x90FD;&#x80FD;&#x591F;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x81F3;&#x4E8E;&#x8BBF;&#x95EE;&#x516C;&#x53F8;&#x5185;&#x7F51;&#xFF0C;&#x8FD9;&#x4E2A;&#x662F;&#x4E2A;&#x76F8;&#x5BF9;&#x6BD4;&#x8F83;&#x5371;&#x9669;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x6211;&#x4EEC;&#x5C0F;&#x516C;&#x53F8;&#x7BA1;&#x7406;&#x5F97;&#x6BD4;&#x8F83;&#x677E;&#x6563;&#x6240;&#x4EE5;&#x8981;&#x7528;&#x7684;&#x65F6;&#x5019;&#x5076;&#x5C14;&#x8FD8;&#x662F;&#x4F1A;&#x7528;&#x7684;&#x3002;</p>
<p>gtun&#x9879;&#x76EE;&#x5199;&#x5B8C;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x624D;&#x4E86;&#x89E3;&#x5230;&#x5185;&#x7F51;&#x7A7F;&#x900F;&#x8FD9;&#x4E2A;&#x8BCD;&#xFF0C;&#x4F46;&#x662F;gtun&#x505A;&#x5185;&#x7F51;&#x7A7F;&#x900F;&#x505A;&#x5F97;&#x8FD8;&#x4E0D;&#x591F;&#x5F7B;&#x5E95;&#xFF0C;&#x6211;&#x601D;&#x8003;&#x4E86;&#x4E0B;&#xFF0C;&#x8BA4;&#x4E3A;&#x5728;gtun&#x9879;&#x76EE;&#x5F53;&#x4E2D;&#x52A0;&#x5165;&#x5B8C;&#x5584;&#x7684;&#x5185;&#x7F51;&#x7A7F;&#x900F;&#x529F;&#x80FD;&#xFF0C;&#x53EA;&#x4F1A;&#x8BA9;gtun&#x5FD8;&#x8BB0;&#x4E86;&#x5B83;&#x7684;&#x4F7F;&#x547D;&#xFF0C;&#x4F1A;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x81C3;&#x80BF;&#xFF0C;&#x4E8E;&#x662F;&#x6211;&#x5C06;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x72EC;&#x7ACB;&#x51FA;&#x6765;&#x5199;&#x4E86;&#x4E00;&#x4E2A;&#x4E13;&#x95E8;&#x89E3;&#x51B3;&#x5185;&#x7F51;&#x7A7F;&#x900F;&#x7684;&#x9879;&#x76EE;&#x2014;&#x2014;<a href="https://www.notr.tech">Notr</a></p>
<p>&#x5BF9;Notr&#x7684;&#x6700;&#x521D;&#x5B9A;&#x4F4D;&#x4E3B;&#x8981;&#x6709;&#x4E24;&#x70B9;&#xFF1A;</p>
<ul>
<li>Notr&#x672C;&#x8EAB;&#x63D0;&#x4F9B;&#x7684;&#x662F;&#x5185;&#x7F51;&#x7A7F;&#x900F;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x6240;&#x4EE5;&#x662F;&#x4E00;&#x6B3E;&#x4EA7;&#x54C1;</li>
<li>Notr&#x8F6F;&#x4EF6;&#x672C;&#x8EAB;&#x5E94;&#x8BE5;&#x5C3D;&#x53EF;&#x80FD;&#x4FDD;&#x6301;&#x8F6F;&#x4EF6;&#x7684;&#x7B80;&#x6D01;&#xFF0C;&#x4E0D;&#x7528;&#x52A0;&#x592A;&#x591A;&#x82B1;&#x91CC;&#x80E1;&#x54E8;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5B83;&#x6700;&#x57FA;&#x672C;&#x7684;&#x4F7F;&#x547D;&#x5C31;&#x662F;&#x8BA9;&#x7528;&#x6237;&#x77E5;&#x9053;&#x9700;&#x8981;&#x7A7F;&#x900F;&#x672C;&#x673A;&#x54EA;&#x4E2A;&#x7AEF;&#x53E3;&#x5C31;&#x80FD;&#x591F;&#x4F7F;&#x7528;&#x3002;</li>
</ul>
<p>&#x7ACB;&#x8DB3;&#x4E8E;&#x4EE5;&#x4E0A;&#x4E24;&#x70B9;&#xFF0C;&#x6211;&#x4EEC;&#x5728;gtun&#x5185;&#x7F51;&#x7A7F;&#x900F;&#x529F;&#x80FD;&#x7684;&#x57FA;&#x7840;&#x4E4B;&#x4E0A;&#xFF0C;&#x52A0;&#x5165;&#x4E86;&#x52A8;&#x6001;&#x57DF;&#x540D;&#x89E3;&#x6790;&#xFF08;DDNS&#xFF09;&#x4EE5;&#x53CA;&#x670D;&#x52A1;&#x6CE8;&#x518C;&#x7B49;&#x529F;&#x80FD;&#x3002;&#x6700;&#x7EC8;&#x5448;&#x73B0;&#x7ED9;&#x7528;&#x6237;&#x7684;&#x7ED3;&#x679C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="https://user-gold-cdn.xitu.io/2019/5/21/16ad99731ef9c228?w=1240&amp;h=1029&amp;f=png&amp;s=870310" alt="&#x4F7F;&#x7528;&#x622A;&#x56FE;"></p>
<h2 class="mume-header" id="notr%E6%8A%80%E6%9C%AF%E5%8F%98%E6%9B%B4">Notr&#x6280;&#x672F;&#x53D8;&#x66F4;</h2>

<p>&#x8C08;&#x5B8C;&#x4E86;&#x9879;&#x76EE;&#x8D77;&#x6E90;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x5E94;&#x8BE5;&#x8981;&#x8C08;&#x8C08;&#x9879;&#x76EE;&#x5177;&#x4F53;&#x7684;&#x6280;&#x672F;&#x53D8;&#x66F4;&#x8FC7;&#x7A0B;&#xFF0C;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x770B;&#x6574;&#x4E2A;&#x9879;&#x76EE;&#x7ECF;&#x5386;&#x4E86;&#x54EA;&#x4E9B;&#x8C03;&#x6574;&#x3002;</p>
<h3 class="mume-header" id="%E5%88%9D%E5%A7%8B%E7%89%88%E6%9C%AC">&#x521D;&#x59CB;&#x7248;&#x672C;</h3>

<p>&#x521D;&#x59CB;&#x7248;&#x672C;&#x5F88;&#x7B80;&#x964B;&#xFF0C;&#x5C31;&#x4E24;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x4E5F;&#x662F;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x6700;&#x5C0F;&#x7684;&#x4E00;&#x4E2A;&#x6A21;&#x578B;&#xFF0C;&#x5305;&#x62EC;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x7AEF;&#x4E24;&#x4E2A;&#xFF0C;&#x670D;&#x52A1;&#x7AEF;&#x6709;&#x4E24;&#x4E2A;&#x529F;&#x80FD;&#xFF1A;</p>
<ol>
<li>&#x670D;&#x52A1;&#x5BA2;&#x6237;&#x7AEF;&#xFF08;&#x9A8C;&#x8BC1;&#xFF0C;session&#x4FDD;&#x5B58;&#xFF0C;IP&#x5730;&#x5740;&#x5206;&#x914D;&#x7B49;&#xFF09;</li>
<li>&#x4E3A;&#x6BCF;&#x4E00;&#x4E2A;&#x9700;&#x8981;&#x7A7F;&#x900F;&#x7684;&#x7AEF;&#x53E3;&#x542F;&#x52A8;&#x4E00;&#x4E2A;&#x672C;&#x5730;&#x7AEF;&#x53E3;&#x4E0E;&#x5176;&#x5BF9;&#x5E94;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E2D;&#x8F6C;</li>
</ol>
<p><img src="https://user-gold-cdn.xitu.io/2019/5/21/16ad9c78d4e78d68?w=2104&amp;h=1028&amp;f=png&amp;s=243153" alt="v1.1"></p>
<p>&#x8FD9;&#x4E00;&#x7248;&#x672C;&#x4E3B;&#x8981;&#x95EE;&#x9898;&#xFF1A;</p>
<ol>
<li>&#x9996;&#x5148;&#x662F;&#x9700;&#x8981;&#x77E5;&#x9053;server&#x7684;IP&#xFF0C;&#x7AEF;&#x53E3;&#x7B49;&#x4FE1;&#x606F;&#xFF0C;&#x6211;&#x4EEC;&#x603B;&#x4E0D;&#x80FD;&#x544A;&#x8BC9;&#x7528;&#x6237;&#x6307;&#x5B9A;&#x54EA;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x5427;</li>
<li>server&#x7684;&#x7AEF;&#x53E3;&#x4FE1;&#x606F;&#x4E0D;&#x56FA;&#x5B9A;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x9488;&#x5BF9;http&#x548C;https&#xFF0C;&#x516C;&#x4F17;&#x53F7;&#x8C03;&#x8BD5;&#x975E;80&#x548C;443&#x7AEF;&#x53E3;&#x7528;&#x4E0D;&#x4E86;</li>
<li>&#x7528;&#x6237;&#x7684;&#x9A8C;&#x8BC1;&#x7684;key&#x662F;&#x5728;server&#x8282;&#x70B9;&#x624B;&#x52A8;&#x6307;&#x5B9A;&#x7684;</li>
<li>&#x7528;&#x6237;&#x6700;&#x540E;&#x62FF;&#x5230;&#x7684;&#x662F;&#x6620;&#x5C04;&#x5230;&#x516C;&#x7F51;&#x7684;IP&#x5730;&#x5740;</li>
</ol>
<p>&#x603B;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x8FD9;&#x4E00;&#x7248;&#x672C;&#x539F;&#x56E0;&#x8C08;&#x4E0D;&#x4E0A;&#x4EA7;&#x54C1;&#xFF0C;&#x7EAF;&#x7CB9;&#x662F;&#x4E00;&#x4E2A;Demo&#xFF0C;&#x81EA;&#x5DF1;&#x7528;&#x5B8C;&#x5168;&#x6CA1;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x4F5C;&#x4E3A;&#x670D;&#x52A1;&#x7ED9;&#x522B;&#x4EBA;&#x7528;&#xFF0C;&#x663E;&#x7136;&#x5C31;&#x62FF;&#x4E0D;&#x51FA;&#x624B;&#x3002;</p>
<h3 class="mume-header" id="%E6%B7%BB%E5%8A%A0%E6%9C%8D%E5%8A%A1%E6%B3%A8%E5%86%8C%E8%8A%82%E7%82%B9%E7%9A%84%E7%89%88%E6%9C%AC">&#x6DFB;&#x52A0;&#x670D;&#x52A1;&#x6CE8;&#x518C;&#x8282;&#x70B9;&#x7684;&#x7248;&#x672C;</h3>

<p>&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x4E0A;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;IP&#x5730;&#x5740;&#x548C;&#x7AEF;&#x53E3;&#x9700;&#x8981;&#x5BA2;&#x6237;&#x7AEF;&#x6307;&#x5B9A;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x51B3;&#x5B9A;&#x5F00;&#x53D1;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#xFF08;&#x8FD9;&#x4E00;&#x63A5;&#x53E3;&#x6240;&#x5728;&#x7684;&#x6A21;&#x5757;&#x6211;&#x4EEC;&#x79F0;&#x4E4B;&#x4E3A;registry&#x6216;&#x8005;controller&#xFF09;&#xFF0C;&#x8BA9;&#x5BA2;&#x6237;&#x7AEF;&#x5728;&#x670D;&#x52A1;&#x7AEF;&#x4E4B;&#x524D;&#xFF0C;&#x5148;&#x53BB;&#x8C03;&#x7528;&#x8FD9;&#x4E00;&#x63A5;&#x53E3;&#xFF0C;&#x62FF;&#x5230;server&#x7684;IP&#x548C;&#x7AEF;&#x53E3;&#x4FE1;&#x606F;&#xFF0C;<strong>&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x8FD9;&#x4E00;&#x63A5;&#x53E3;&#x670D;&#x52A1;&#x5177;&#x5907;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x7684;&#x89C6;&#x91CE;</strong>&#xFF0C;&#x4FDD;&#x5B58;&#x6240;&#x6709;server&#x8282;&#x70B9;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x8FD9;&#x91CC;&#x9762;&#x9700;&#x8981;&#x8003;&#x8651;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x2014;&#x2014;registry&#x5982;&#x4F55;&#x77E5;&#x9053;server&#x8282;&#x70B9;&#x7684;&#x5B58;&#x5728;&#x4EE5;&#x53CA;server&#x8282;&#x70B9;&#x662F;&#x5426;&#x8FD8;&#x5728;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x6700;&#x521D;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x542F;&#x52A8;&#x7684;&#x65F6;&#x5019;&#x901A;&#x8FC7;http&#x8C03;&#x7528;registry&#x7684;&#x4E00;&#x4E2A;register&#x63A5;&#x53E3;&#xFF0C;&#x9000;&#x51FA;&#x7684;&#x65F6;&#x5019;&#x518D;&#x8C03;&#x7528;registry&#x7684;unregister&#x63A5;&#x53E3;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x65F6;&#x5E76;&#x4E0D;&#x662F;&#x8BF4;&#x6CA1;&#x8C03;unregister&#x5C31;&#x8BF4;&#x660E;&#x670D;&#x52A1;&#x5728;&#x8FD0;&#x884C;&#xFF0C;<strong>&#x4E8E;&#x662F;&#x5C06;server&#x548C;registry&#x7684;&#x901A;&#x4FE1;&#x534F;&#x8BAE;&#x4ECE;http&#x534F;&#x8BAE;&#x6362;&#x6210;&#x4E86;tcp&#x957F;&#x94FE;&#x63A5;&#x3002;</strong></p>
<p>&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x7B2C;&#x4E8C;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x9488;&#x5BF9;http&#x548C;https&#x65E0;&#x6CD5;&#x505A;&#x5230;&#x7AEF;&#x53E3;&#x590D;&#x7528;&#xFF0C;&#x591A;&#x4E2A;&#x7528;&#x6237;&#x65E0;&#x6CD5;&#x5171;&#x7528;80&#x548C;443&#x7AEF;&#x53E3;&#xFF0C;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x5F15;&#x5165;&#x4E86;nginx&#xFF0C;&#x901A;&#x8FC7;nginx&#x5E2E;&#x6211;&#x4EEC;&#x5B9E;&#x73B0;http&#x548C;https&#x7684;&#x4EE3;&#x7406;&#x3002;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x5F88;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#xFF0C;&#x6211;&#x4EEC;&#x8BA9;nginx&#x5E2E;&#x6211;&#x4EEC;&#x505A;&#x53CD;&#x5411;&#x4EE3;&#x7406;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x518D;&#x81EA;&#x5DF1;&#x76D1;&#x542C;&#x7AEF;&#x53E3;&#xFF0C;nginx&#x6839;&#x636E;Host&#x6765;&#x505A;&#x533A;&#x5206;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x7B2C;&#x4E09;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x5F80;registry&#x6A21;&#x5757;&#x5F15;&#x5165;&#x529F;&#x80FD;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;Notr&#x4ECE;&#x4E00;&#x4E2A;Demo&#x8F6C;&#x5411;&#x4EA7;&#x54C1;&#x7684;&#x6700;&#x4E3B;&#x8981;&#x7684;&#x4E00;&#x4E2A;&#x6B65;&#x9AA4;&#x3002;&#x6211;&#x4EEC;&#x5728;registry&#x6A21;&#x5757;&#x91CC;&#x9762;&#x52A0;&#x5165;&#x4E86;&#x7528;&#x6237;&#x6A21;&#x5757;&#x3002;&#x6240;&#x6709;&#x7528;&#x6237;&#x7684;&#x6CE8;&#x518C;&#x767B;&#x5F55;&#x4EE5;&#x53CA;key&#x7BA1;&#x7406;&#xFF0C;&#x90FD;&#x5728;registry&#x6A21;&#x5757;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x7B2C;&#x56DB;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x6DFB;&#x52A0;&#x4E86;&#x4E00;&#x4E2A;&#x4E0E;&#x57DF;&#x540D;&#x76F8;&#x5173;&#x7684;&#x6A21;&#x5757;&#x2014;&#x2014;DDNS&#xFF0C;&#x6211;&#x4EEC;DDNS&#x7684;&#x539F;&#x5219;&#x662F;&#xFF1A;</p>
<ul>
<li>&#x5982;&#x679C;&#x7528;&#x6237;&#x5DF2;&#x7ECF;&#x6CE8;&#x518C;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x6839;&#x636E;&#x7528;&#x6237;&#x540D;&#x4FE1;&#x606F;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x7684;&#x57DF;&#x540D;</li>
<li>&#x5982;&#x679C;&#x7528;&#x6237;&#x6CA1;&#x6709;&#x6CE8;&#x518C;&#xFF0C;&#x6211;&#x4EEC;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x57DF;&#x540D;&#xFF0C;&#x8BA9;&#x975E;&#x6CE8;&#x518C;&#x7528;&#x6237;&#xFF0C;&#x4E5F;&#x80FD;&#x4F53;&#x9A8C;</li>
</ul>
<p>&#x8FD9;&#x6837;&#xFF0C;&#x65E0;&#x8BBA;&#x5E95;&#x5C42;server&#x8282;&#x70B9;&#x5982;&#x4F55;&#x5207;&#x6362;&#xFF0C;&#x5BF9;&#x4E8E;&#x7528;&#x6237;&#x800C;&#x8A00;&#x90FD;&#x662F;&#x900F;&#x660E;&#x7684;&#xFF0C;&#x7528;&#x6237;&#x611F;&#x77E5;&#x4E0D;&#x5230;&#xFF0C;&#x53EA;&#x662F;&#x6211;&#x4EEC;&#x540E;&#x53F0;&#x505A;&#x4E86;&#x57DF;&#x540D;&#x89E3;&#x6790;&#x8BB0;&#x5F55;&#x7684;&#x4FEE;&#x6539;&#x800C;&#x5DF2;&#x3002;</p>
<p>&#x8FD9;&#x4E00;&#x7248;&#x672C;&#x7684;&#x65F6;&#x5E8F;&#x56FE;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="https://user-gold-cdn.xitu.io/2019/5/21/16ad9b6443865229?w=1682&amp;h=1376&amp;f=png&amp;s=288296" alt="v1.2"></p>
<p>&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x8FD9;&#x4E00;&#x7248;&#x672C;&#x57FA;&#x672C;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x62FF;&#x53BB;&#x7ED9;&#x522B;&#x4EBA;&#x8BD5;&#x7528;&#x4E86;&#xFF0C;&#x6B64;&#x65F6;&#x8F6F;&#x4EF6;&#x95EE;&#x9898;&#x5F00;&#x59CB;&#x6162;&#x6162;&#x66B4;&#x9732;&#xFF1A;</p>
<ul>
<li>&#x672C;&#x5730;&#x7684;&#x670D;&#x52A1;&#x9700;&#x8981;&#x76D1;&#x542C;0.0.0.0&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x771F;&#x5B9E;&#x8BBF;&#x95EE;&#x7684;&#x662F;&#x672C;&#x5730;&#x865A;&#x62DF;&#x7F51;&#x5361;&#x7684;IP&#x5730;&#x5740;&#xFF0C;&#x800C;&#x5F88;&#x591A;web&#x5BB9;&#x5668;&#x53EF;&#x80FD;&#x9ED8;&#x8BA4;&#x76D1;&#x542C;&#x7684;&#x662F;127.0.0.1</li>
<li>windows&#x9700;&#x8981;&#x5B89;&#x88C5;tap&#x9A71;&#x52A8;&#xFF0C;&#x529D;&#x9000;&#x4E86;&#x4E0D;&#x5C11;&#x4EBA;</li>
<li>&#x9700;&#x8981;&#x7BA1;&#x7406;&#x5458;&#x6743;&#x9650;&#x542F;&#x52A8;&#xFF0C;&#x5F88;&#x591A;&#x7528;&#x6237;&#x5B89;&#x5168;&#x610F;&#x8BC6;&#x5F88;&#x9AD8;&#xFF0C;&#x53C8;&#x529D;&#x9000;&#x4E86;&#x4E00;&#x90E8;&#x5206;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x6301;&#x7EED;&#x4E86;&#x5F88;&#x4E45;&#xFF0C;&#x6700;&#x540E;&#x5728;&#x6625;&#x8282;&#x653E;&#x5047;&#x671F;&#x95F4;&#x8FDB;&#x884C;&#x4E86;&#x4E00;&#x6B21;&#x65B9;&#x6848;&#x8C03;&#x6574;&#xFF0C;&#x628A;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x90FD;&#x5F7B;&#x5E95;&#x6D88;&#x706D;&#x6389;&#x4E86;&#x3002;</p>
<h3 class="mume-header" id="%E4%B8%8D%E4%BD%BF%E7%94%A8%E8%99%9A%E6%8B%9F%E7%BD%91%E5%8D%A1%E7%9A%84%E7%89%88%E6%9C%AC">&#x4E0D;&#x4F7F;&#x7528;&#x865A;&#x62DF;&#x7F51;&#x5361;&#x7684;&#x7248;&#x672C;</h3>

<p>&#x5728;&#x4E0A;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#x4E2D;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x95EE;&#x9898;&#x90FD;&#x51FA;&#x5728;&#x65B9;&#x6848;&#x4F7F;&#x7528;&#x4E86;&#x865A;&#x62DF;&#x7F51;&#x5361;&#x6784;&#x5EFA;&#x865A;&#x62DF;&#x5C40;&#x57DF;&#x7F51;&#x4E0A;&#xFF0C;&#x6B63;&#x662F;&#x56E0;&#x4E3A;&#x4F7F;&#x7528;&#x865A;&#x62DF;&#x7F51;&#x5361;&#xFF0C;&#x6240;&#x4EE5;windows&#x9700;&#x8981;&#x5B89;&#x88C5;tap&#x9A71;&#x52A8;&#xFF0C;&#x4E5F;&#x6B63;&#x662F;&#x56E0;&#x4E3A;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x865A;&#x62DF;&#x7F51;&#x5361;&#xFF0C;&#x6240;&#x4EE5;&#x624D;&#x9700;&#x8981;&#x7BA1;&#x7406;&#x5458;&#x6743;&#x9650;&#x542F;&#x52A8;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x6700;&#x540E;&#x6211;&#x4EEC;&#x51B3;&#x5B9A;&#x628A;&#x865A;&#x62DF;&#x7F51;&#x5361;&#x53BB;&#x6389;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x5916;&#x800C;&#x8A00;&#xFF0C;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x53D1;&#x751F;&#x4EFB;&#x4F55;&#x6539;&#x53D8;&#xFF0C;&#x6211;&#x4EEC;&#x867D;&#x7136;&#x6D88;&#x9664;&#x4E86;&#x865A;&#x62DF;&#x7F51;&#x5361;&#xFF0C;&#x4F46;&#x662F;&#x5185;&#x90E8;&#x4ECE;server&#x5230;client&#xFF0C;&#x4F9D;&#x7136;&#x662F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x865A;&#x62DF;IP&#x5730;&#x5740;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;Nginx&#x53CD;&#x5411;&#x4EE3;&#x7406;&#x8FD9;&#x4E00;&#x5C42;&#xFF0C;&#x5B8C;&#x5168;&#x4E0D;&#x9700;&#x8981;&#x505A;&#x4EFB;&#x4F55;&#x66F4;&#x6539;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x76F8;&#x5BF9;&#x4E0A;&#x4E00;&#x7248;&#x672C;&#x800C;&#x8A00;&#xFF0C;&#x51CF;&#x5C11;&#x4E86;&#x865A;&#x62DF;&#x7F51;&#x5361;&#x7684;&#x5B89;&#x88C5;&#x4EE5;&#x53CA;&#x7BA1;&#x7406;&#x5458;&#x6743;&#x9650;&#xFF0C;&#x4E8E;&#x7528;&#x6237;&#x800C;&#x8A00;&#x5E94;&#x8BE5;&#x662F;&#x66F4;&#x52A0;&#x65B9;&#x4FBF;&#x4E86;&#x3002;</p>
<p><strong>&#x4ECE;&#x6280;&#x672F;&#x7EC6;&#x8282;&#x4E0A;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E2A;&#x7248;&#x672C;&#x7684;&#x6539;&#x53D8;&#xFF0C;&#x6211;&#x4EEC;&#x5173;&#x952E;&#x7684;&#x66F4;&#x6539;&#x5728;&#x4E8E;&#x7528;DNAT&#x5C06;Nginx&#x7684;&#x53CD;&#x5411;&#x4EE3;&#x7406;&#x6D41;&#x91CF;&#x5168;&#x90E8;&#x5BFC;&#x5230;&#x6211;&#x4EEC;server&#x76D1;&#x542C;&#x7684;&#x4E00;&#x4E2A;tcp&#x7AEF;&#x53E3;&#xFF0C;&#x5E76;&#x5728;&#x5185;&#x90E8;&#x627E;&#x5230;&#x8FD9;&#x4E00;&#x6570;&#x636E;&#x6D41;&#x5BF9;&#x5E94;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x5C06;&#x6570;&#x636E;&#x8F6C;&#x53D1;&#x5230;&#x5BA2;&#x6237;&#x7AEF;&#x4E0A;&#x3002;&#x4E0A;&#x4E00;&#x7248;&#x672C;&#x5B8C;&#x5168;&#x662F;&#x901A;&#x8FC7;&#x8DEF;&#x7531;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#xFF0C;&#x8FD9;&#x662F;&#x8FD9;&#x4E24;&#x4E2A;&#x65B9;&#x6848;&#x6700;&#x5927;&#x7684;&#x533A;&#x522B;&#x3002;</strong></p>
<h3 class="mume-header" id="%E8%B4%9F%E8%BD%BD%E5%9D%87%E8%A1%A1%E7%AD%96%E7%95%A520190611">&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x7B56;&#x7565;&#xFF08;2019.06.11&#xFF09;</h3>

<p>&#x76EE;&#x524D;notr&#x5185;&#x7F51;&#x7A7F;&#x900F;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x5747;&#x90E8;&#x7F72;&#x5728;&#x4E2D;&#x56FD;&#x5927;&#x9646;&#x5883;&#x5185;&#xFF0C;&#x6700;&#x8FD1;&#x78B0;&#x5230;&#x4E00;&#x4E2A;&#x6D77;&#x5916;&#x7528;&#x6237;&#x95EE;&#x9898;&#xFF0C;&#x6709;&#x4E2A;&#x6D77;&#x5916;&#x7528;&#x6237;&#x5E0C;&#x671B;&#x4F7F;&#x7528;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x8FD0;&#x884C;&#x5728;&#x65B0;&#x52A0;&#x5761;&#xFF0C;&#x6839;&#x636E;&#x65E7;&#x7684;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x7B56;&#x7565;&#xFF0C;&#x4F1A;&#x6839;&#x636E;&#x6BCF;&#x4E2A;&#x670D;&#x52A1;&#x8282;&#x70B9;&#x670D;&#x52A1;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x6570;&#x91CF;&#x6765;&#x9009;&#x62E9;&#x8282;&#x70B9;&#x7ED9;&#x5BA2;&#x6237;&#x7AEF;&#x3002;&#x8FD9;&#x91CC;&#x5C31;&#x4F1A;&#x6709;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;</p>
<ul>
<li>&#x6D77;&#x5916;&#x5BA2;&#x6237;&#x7AEF;&#x8DDF;&#x4E2D;&#x56FD;&#x5927;&#x9646;&#x901A;&#x4FE1;&#xFF0C;&#x957F;&#x8DDD;&#x79BB;tcp&#x4E22;&#x5305;&#x4E25;&#x91CD;&#xFF0C;&#x5EF6;&#x65F6;&#x9AD8;</li>
</ul>
<p>&#x6839;&#x636E;&#x7528;&#x6237;&#x53CD;&#x9988;&#xFF0C;&#x5EF6;&#x65F6;&#x8FBE;&#x5230;&#x4E24;&#x767E;&#x591A;&#x6BEB;&#x79D2;&#xFF0C;&#x4F7F;&#x7528;ssh&#x65F6;&#x6709;&#x5361;&#x987F;&#x73B0;&#x8C61;&#xFF0C;&#x4E0D;&#x662F;&#x5F88;&#x987A;&#x7545;&#xFF0C;&#x5F53;&#x65F6;&#x7D27;&#x6025;&#x5F00;&#x542F;&#x4E86;&#x4E00;&#x4E2A;&#x9999;&#x6E2F;&#x8282;&#x70B9;&#xFF0C;&#x4F46;&#x662F;&#x6839;&#x636E;&#x539F;&#x6765;&#x7684;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x7B56;&#x7565;&#xFF0C;&#x7528;&#x6237;&#x53EA;&#x80FD;&#x8BF4;&#x6709;&#x4E00;&#x5B9A;&#x6982;&#x7387;&#x4F1A;&#x8D70;&#x9999;&#x6E2F;&#x8282;&#x70B9;&#xFF0C;&#x5E76;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x4E00;&#x5B9A;&#x8D70;&#x3002;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;Notr&#x7684;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x7B56;&#x7565;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x673A;&#x5236;&#xFF1A;</p>
<ul>
<li>&#x6839;&#x636E;&#x5BA2;&#x6237;&#x7AEF;IP&#x6765;&#x5224;&#x65AD;&#x5BA2;&#x6237;&#x7AEF;&#x6240;&#x5C5E;&#x533A;&#x57DF;&#xFF0C;&#x7136;&#x540E;&#x9009;&#x62E9;&#x8BE5;&#x533A;&#x57DF;&#x7684;&#x670D;&#x52A1;&#x8282;&#x70B9;</li>
</ul>
<p>&#x8FD9;&#x6837;&#x4FDD;&#x8BC1;&#x4E86;&#x6D77;&#x5916;&#x7528;&#x6237;&#x8FDE;&#x6D77;&#x5916;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x5EF6;&#x65F6;&#x4ECE;245ms&#x53D8;&#x6210;43ms&#x3002;&#x4F7F;&#x7528;&#x4E5F;&#x66F4;&#x52A0;&#x987A;&#x7545;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x5F88;&#x65E9;&#x4E4B;&#x524D;&#x5C31;&#x60F3;&#x8FC7;&#x6DFB;&#x52A0;&#xFF0C;&#x4F46;&#x662F;&#x9274;&#x4E8E;&#x5F53;&#x65F6;&#x7528;&#x6237;&#x57FA;&#x672C;&#x90FD;&#x5728;&#x56FD;&#x5185;&#xFF0C;&#x56FD;&#x5916;&#x7528;&#x6237;&#x57FA;&#x672C;&#x6CA1;&#x6709;&#xFF0C;&#x57FA;&#x672C;&#x7528;&#x6237;&#x4E5F;&#x80FD;&#x63A5;&#x53D7;&#xFF0C;&#x6CA1;&#x6709;&#x60F3;&#x5230;&#x4F1A;&#x6709;&#x6D77;&#x5916;&#x7528;&#x6237;&#x60F3;&#x8981;&#x4F7F;&#x7528;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x4E00;&#x76F4;&#x6CA1;&#x6709;&#x5F00;&#x53D1;&#x8FD9;&#x4E00;&#x529F;&#x80FD;&#xFF0C;&#x76EE;&#x524D;&#x8BE5;&#x529F;&#x80FD;&#x5DF2;&#x7ECF;&#x6B63;&#x5F0F;&#x4E0A;&#x7EBF;&#x3002;</p>
<h2 class="mume-header" id="%E6%9C%80%E5%90%8E">&#x6700;&#x540E;</h2>

<p>Notr&#x76EE;&#x524D;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x53EF;&#x4EE5;&#x770B;&#x89C1;&#x7684;&#x95EE;&#x9898;&#x9700;&#x8981;&#x89E3;&#x51B3;&#xFF0C;&#x4F46;&#x662F;&#x4E2A;&#x4EBA;&#x7CBE;&#x529B;&#x6709;&#x9650;&#xFF0C;&#x8FDB;&#x5EA6;&#x76F8;&#x5BF9;&#x4F1A;&#x6BD4;&#x8F83;&#x6162;&#x3002;</p>
<p>&#x524D;&#x6BB5;&#x65F6;&#x95F4;&#x6709;&#x4E2A;&#x7528;&#x6237;&#x622A;&#x4E86;&#x4ED6;&#x7684;&#x7528;&#x6237;&#x4FE1;&#x606F;&#x7ED9;&#x6211;&#xFF0C;&#x6211;&#x770B;&#x4E86;&#x4E0B;&#xFF0C;&#x662F;2018&#x5E74;8&#x6708;&#x4EFD;&#x8FC7;&#x671F;&#x7684;&#xFF0C;&#x5F53;&#x65F6;&#x6BCF;&#x4E2A;&#x7528;&#x6237;&#x7684;&#x8BD5;&#x7528;&#x671F;&#x662F;&#x4E00;&#x4E2A;&#x6708;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;2017&#x5E74;7&#x6708;&#x4EFD;&#x5F00;&#x59CB;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#xFF0C;&#x5F53;&#x65F6;&#x5C31;&#x5F88;&#x611F;&#x6168;&#xFF0C;Notr&#x5DF2;&#x7ECF;&#x5199;&#x4E86;&#x8FD9;&#x4E48;&#x4E45;&#x4E86;&#x5417;&#xFF1F;&#x540C;&#x65F6;&#x4E5F;&#x611F;&#x5230;&#x9AD8;&#x5174;&#xFF0C;&#x5F88;&#x9AD8;&#x5174;&#x81EA;&#x5DF1;&#x80FD;&#x591F;&#x575A;&#x6301;&#x505A;&#x8FD9;&#x4EF6;&#x4E8B;&#x505A;&#x8FD9;&#x4E48;&#x4E45;&#xFF0C;&#x867D;&#x7136;&#x4E0D;&#x77E5;&#x9053;&#x7ED3;&#x679C;&#x4F1A;&#x5982;&#x4F55;&#x3002;</p>

      </div>